In [1]:
import pandas as pd

In [3]:
print("Hello again!")

Hello again!

In [57]:
salaries = pd.Series([70, 90, 90, 80, 130, 500, 60])
salaries.describe().std()

151.93118850322801

In [52]:
salaries.mode()

0    90
dtype: int64

In [50]:
random_numbers = pd.Series([-5, -4, -1, 2, 4, 6, 6, 7, 0])

print('Random Numbers\n')
print(f'Mean: {random_numbers.mean()}')
print(f'Median: {random_numbers.median()}')
print(f'Mode: {random_numbers.mode()}')

Random Numbers

Mean: 1.6666666666666667
Median: 2.0
Mode: 0    6
dtype: int64

In [31]:
titanic = pd.read_csv('titanic.csv')

In [43]:
ages = titanic["Age"]
print('Age')
print(f'Mean: {ages.mean()}')
print(f'Median: {ages.median()}')
print(f'Mode: {ages.mode()}')

Age
Mean: 29.69911764705882
Meadian: 28.0
Mode: 0    24.0
dtype: float64

In [37]:
print(f'Oldest Passenger: {ages.max()}')

Oldest Passenger: 80.0

In [41]:
print(f'Cheapest Ticket: {titanic["Fare"].min()}')

Cheapest Ticket: 0.0

In [46]:
print(f'Range of Ticket Price: {titanic["Fare"].max() - titanic["Fare"].min()}')

Range of Ticket Price: 512.3292

In [47]:
titanic.mode()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3.0,"Abbing, Mr. Anthony",male,24.0,0.0,0.0,1601,8.05,B96 B98,S
1,2,NaN,NaN,"Abbott, Mr. Rossmore Edward",NaN,NaN,NaN,NaN,347082,NaN,C23 C25 C27,NaN
2,3,NaN,NaN,"Abbott, Mrs. Stanton (Rosa Hunt)",NaN,NaN,NaN,NaN,CA. 2343,NaN,G6,NaN
3,4,NaN,NaN,"Abelson, Mr. Samuel",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,NaN,NaN,"Abelson, Mrs. Samuel (Hannah Wizosky)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,NaN,NaN,"de Mulder, Mr. Theodore",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,888,NaN,NaN,"de Pelsmaeker, Mr. Alfons",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
888,889,NaN,NaN,"del Carlo, Mr. Sebastiano",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
889,890,NaN,NaN,"van Billiard, Mr. Austin Blyler",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
890,891,NaN,NaN,"van Melkebeke, Mr. Philemon",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN